Repository: BekaHaile/fbpidi_django
Catalog: locale/*/LC_MESSAGES/django.po
Languages: am

source: Password
am: የይለፍ ቃል ቀይር

source: Amharic
am: አማርኛ

source: Page not found
am: የፈለጉት ገጽ የለም

source: We’re sorry, but the requested page could not be found.
am: የጠየቁትን ግጽ ማግኘት አልቻልንም

source: Home
am: ዋና ገጽ

source: Welcome,
am: እንኳን በደህና መጡ

source: Ecommerce - Product Detail
am: የምርት ዝርዝር

source: Search
am: ፈልግ

source: Announcement List
am: ማስታወቂያ

source: Page
am: ገጾች

source: of
am: ከ

source: All
am: ሁሉም

source: At
am: በ

source: Prev
am: የበፈቱን

source: Next
am: ቀጣይ

source: Filter by company
am: በድርጅት አጣራ

source: Apply Filter
am: አጣራ

source: Announcement
am: ማስታወቂያ

source: Company Contact Info
am: የድርጅቱ አድራሻ

source: Blog
am: ብሎግ

source: Tags
am: መለያዎች

source: Comments
am: አስተያየት ያክሉ

source: Add a Comment
am: አስተያየት ያክሉ

source: Submit
am: አስገባ

source: Blog list
am: ብሎግ

source: By
am: በ

source: Read More
am: ተጨማሪ ያንብቡ

source: To Chat List
am: የእርሶ ውይይት ከ

source: Your Chats with
am: የእርሶ ውይይት ከ

source: About Us
am: ስለ እኛ

source: Company Home Page
am: የድርጅቱ ዎና ገጽ

source: Company Announcement List
am: ማስታወቂያ

source: Pages
am: ገጾች

source: Announcement Details
am: ማስታወቂያ

source: Annnouncement Description
am: ማስታወቂያ

source: Blogs
am: ብሎግ

source: Company Blog List
am: ድርጅቶች

source: Blog Detail
am: የብሎጉ ዝርዝር

source: Company Blogs List
am: የድርጅቱ ብሎጎች

source: Blog Details
am: የብሎጉ ዝርዝር

source: Event Detail
am: የዝግጅቱ ዝርዝር

source: Company Events List
am: የዝግጅቶች ዝርዝር

source: Event Details
am: የዝግጅቱ ዝርዝር

source: Start Date
am: የሚጀምርበት ቀን

source: End Date
am: የሚያልቅበት ቀን

source: Open
am: ክፈት

source: Upcoming
am: ወደፊት የሚመጡ

source: Closed
am: ዝግ

source: From
am: ከ

source: Remind Me
am: የማስታወሻ መልዕክት ላክ

source: Event Description
am: የምርምር መግለጫ

source: Events
am: ዝግጅቶች

source: Company Event List
am: ክፈት ዝግጅቶች

source: Faqs
am: ተየጥ

source: Company Faq List
am: የድርጅት ተደጋጋሚ ጥያቄዎች

source: Faq Detail
am: ዝርዝር

source: Faq Details
am: ዝርዝር

source: Contact Info
am: የድርጅቱ አድራሻ

source: More Company Info
am: የድርጅቱ አድራሻ

source: Established Year
am: የምስርታ አምት

source: Services
am: አገልግሎቶች

source: Certification
am: የማረጋገጫ ሰርተፊኬት

source: Products
am: ምርት

source: Contact Manufacturer
am: አምራቾች

source: Chat
am: ንግግር

source: Contact Me
am: ተገናኙን

source: Send Inquiry
am: የምርት ጥያቄ ላክ

source: Listing location
am: መልክት

source: Get Direction
am: የምርምር መግለጫ

source: Send Message
am: መልዕክቱን ላክ

source: Cancel
am: ሰርዝ

source: Send
am: ላክ

source: Leave a Comment
am: አስተያየት ያክሉ

source: Direction
am: መልክት

source: Report Abuse
am: ቅሬታ አምልክት

source: My Cart
am: ዘንቢል

source: My Profile
am: የራስ አካውንት

source: My Messages
am: መልዕክቶች

source: List of Messages
am: የመልክዕት ዝርዝር

source: Logout
am: ውጣ

source: Register
am: ተመዝገብ

source: Login
am: ግባ

source: Language
am: ቋንቋ

source: English
am: እንግሊዝኛ

source: Amharic
am: አማርኛ

source: Research
am: ምርምር

source: Project
am: ፕሮጀክት

source: News
am: ዜና

source: Tenders
am: ጨረታዎቸ

source: Vacancy
am: ክፍት የሥራ ቦታ

source: Collaborations
am: መተባበሪያ

source: Polls
am: ምረጫ

source: Contact Us
am: ተገናኙን

source: Subscribe
am: ይመዝገቡ

source: listings available
am: የተገኙ ውጤቶች

source: Industry List
am: የኢንዱስትሪ ዝርዝር

source: Industries
am: ኢንዱስትሪዎች

source: Showing
am: ገጽ

source: Sort By
am: ቅደም ተከተል

source: Distance
am: ርቀት

source: Latest
am: አዳዲሶች

source: Rating
am: በተጠቃሚ ምርጫ

source: Get Directions
am: አቅጣጫ ያግኙ

source: Categories
am: ምድቦች

source: Food
am: ምግብ

source: Beverage
am: መጠጥ

source: Pharmaceutical
am: መድሃኒት

source: Company News List
am: የድርጅት ዚናዎች

source: News Detail
am: የዜና ዝርዝር

source: News Details
am: የዜና ዝርዝር

source: News Description
am: የምርምር መግለጫ

source: Company Polls List
am: የድርጅት ምርጫዎች

source: Choices
am: አማራጮች

source: Choice
am: አማራጭ

source: Votes
am: ድምጾች

source: Vote
am: ድምጽ

source: Poll Detail
am: የምርጫ ዝርዝር

source: Poll-Details
am: የምርጫ ዝርዝርው

source: Total Votes
am: ጠቅላላ መራጮች

source: You can not vote on this poll, since your company created the poll.
am: የምርጫው ፈጣሪ እርስዎ ነዎት ስለሆነም በዚህ ምርጫ ላይ ድምጽ መስጠት አይችሉም

source: Super users cannot Vote.
am: ልዕለ ተጠቃሚዎች ድምጽ መስጠት አይችሉም

source: You already have voted for this poll.
am: ለዚህ ምርጫ አስቀድመው ድምጽ ሰጥተዋል

source: This poll has no choice, yet!
am: ይህ ምርጫ ምንም አማራጮች የሉትም!

source: Any Remarks
am: ማንኛውም አስተያየት

source: Submit Vote
am: ድምጽ ያስገቡ

source: Poll description
am: የምርጫው መግለጫ

source: Applicant Form
am: የአመልካች ቅጽ

source: First Name
am: የመጀመሪያ ስም

source: Last Name
am: ያባት ስም

source: Company Name
am: የድርጅት ስም

source: Company Tin Number
am: ኩባንያ ቲን ቁጥር

source: Email
am: ኢሜል

source: Phone Number
am: ስልክ ቁጥር

source: Researchs
am: ምርምር

source: Company obj List
am: ድርጅቶች

source: Research Detail
am: የምርምር ዝርዝር

source: Company Research List
am: የምርምር ርዕስ

source: Research Details
am: የምርምር ዝርዝር

source: status
am: ሁኔታ

source: Category
am: ምድብ

source: Research Files
am: የምርምር ርዕስ

source: Research Description
am: የምርምር መግለጫ

source: Tender-Details
am: ጨረታ ዝርዝር

source: Company Tender List
am: ኩባንያ ቲን ቁጥር

source: Type
am: አይነት

source: Price
am: ዋጋ

source: Total Applications
am: የአመልካች ቅጽ

source: Download Document
am: ፋይል አውርድ

source: Users from tender company can't participate in their own tender!
am: ከጨረታ ኩባንያ የመጡ ተጠቃሚዎች በራሳቸው ጨረታ ላይ መሳተፍ አይችሉም

source: Participate in tender
am: በጨረታ ውስጥ ይሳተፉ

source: This Tender is not Free, You can read the description below and attend the tender in person!
am: ይህ ጨረታ ነፃ አይደለም ፣ ከዚህ በታች ያለውን መግለጫ በማንበብ ጨረታውን በአካል ተገኝተው ማግኘት ይችላሉ!

source: Tender description
am: ጨረታ መግለጫ

source: Tender Detail
am: የጨረታ ዝርዝር

source: Company Vacancy List
am: የድርጅቱ ክፍት የስራ ቦታዎች

source: View job details
am: የስራው መግለጫ

source: Apply
am: አመልክት

source: Appying to
am: ማመልከቻ

source: Job application form
am: የማምልከቻ ቅጽ

source: Status
am: ወቅታዊ ሁኔታ

source: The institute you learned in
am: የተማሩበት የት/ት ተቋም

source: The field you are an expert in
am: የሙያ አይነት

source: Grade
am: ውጤት

source: experiance (in years)
am: የስራ ልምድ (አመት)

source: Introduce your self
am: እራሶን ያስተዋውቁ

source: Upload your CV
am: CV አያይዝ

source: Upload your Documents (This is for certifivates and other documents)
am: ተያያዥ ማስረጃዎችን ያያይዙ

source: Vacancy-Detail
am: ክፍት የሥራ ቦታ

source: Location
am: መልክት

source: Salary
am: ደሞዝ

source: Requirement
am: ቅድመ-ሁኔታ

source: Description
am: መግለጫ

source: Contact
am: ተገናኙን

source: Product In Stock
am: በክምችት ያለ ምርት

source: Contact Manfacturer
am: አምራቾች

source: Send Message to Manufacturer
am: አምራቾች

source: Contact Supplier
am: አቅራቢዎች

source: to
am: ለ

source: Projects
am: ፕሮጀክት

source: FAQ
am: ተይጥ

source: Welcome To The Biggest Business Directory
am: ወደ ትልቁ የንግድ ማውጫ እንኳን በደህና መጡ!

source: It is a long established fact that a reader will be distracted by the readable.
am: አንባቢ በሚነበብ ነገር ሊዘናጋ መሆኑ ረጅም የተረጋገጠ ሀቅ ነው ፡፡

source: Search Products
am: ምርት ፈልግ

source: Search Companies
am: ድርጅቶችን ፈልግ

source: Enter Your Product Keywords
am: የመፈለግያ ቃላት ጻፍ

source: Select Category
am: ምድብ ምረጥ

source: Search Now
am: ፈልግ

source: Enter Your Companies Keywords
am: የመፈለግያ ቃላት ጻፍ

source: Enter Your Others Keywords
am: የመፈለግያ ቃላት ጻፍ

source: Companies
am: ድርጅቶች

source: Latest Products
am: አዲስ ምርቶች

source: Mauris ut cursus nunc. Morbi eleifend, ligula at consectetur vehicula
am: ሞርቢ አሥራ አንድ ፣ ሊጉላ በሴሴቲተር ተሸከርካሪ ላይ ሞርቢ አሥራ አንድ ፣ ሊጉላ በሴሴቲተር ተሸከርካሪ ላይ

source: Total Products
am: ምርት

source: Total Manufacturers
am: አምራቾች

source: Happy Customers
am: ደንበኞች

source: Latest Manufacturers
am: አምራቾች

source: How It Works?
am: እንደት ይሰራል

source: You can register and get Unlimited Functionalities
am: ተመዝግበዉ የማያልቁ አገልግሎት ያግኙ

source: Create Account
am: አካዉንት ከፈት

source: You Can Create Account and Get Unlimited Functionalities
am: አካዉንት ከፍተዉ የማያልቅ አገልግሎት ያግኙ

source: Add Products
am: ምርት ጨምር

source: You Can Add your Products and comunicate with buyers
am: መርቶትን ለሸማቾች ያቀርቡ

source: Get Earnings
am: ትረፍ ያግኙ

source: You can register, add products,buy products and get Your earnings
am: አካዉንት ከፍተዉ የማያልቅ አገልግሎት ያግኙ

source: Latest Suppliers
am: አቅራቢዎች

source: Enter your Email
am: ኢመይል ያስገቡ

source: Getting Started
am: አሁን ይጀምሩ

source: Exsiting User
am: በፊት የተመዝገበ

source: it look like readable English. Many desktop publishing packages and web page editors now use Lorem Ipsum as their default model text
am: የሚነበብ እንግሊዝኛ ይመስላል። ብዙ የዴስክቶፕ ማተሚያ ጥቅሎች እና ድረ-ገጽ አርታኢዎች አሁን ሎረም አይፕሱምን እንደ

source: New User
am: አዲስ ተጠቃሚ

source: Latest News
am: አቅራቢዎች

source: In Ethiopian Food, Beverage and Pharmaceutical Industry.
am: በኢትዮጵያ የምግብ፣ መጠጥ እና መድሃኒቶች ኢንዱስትሪ

source: Categories List
am: የምርት አይነቶች

source: Food Sectors
am: መግብ

source: Beverage Sectors
am: መጠጥ

source: Pharmaceutical Sectors
am: መድሃኒት

source: Download App
am: መተግበሪያ አዉርድ

source: List of Messages
am: የመልክዕት ዝርዝር

source: Manufacturers
am: አምራቾች

source: Foods
am: ምግብ

source: Beverages
am: መጠጥ

source: Pharmaceuticals
am: መድሃኒት

source: Forums
am: ዉይይት

source: Company Address
am: የድርጅት አድራሻ

source: Company Information
am: የግብይት መረጃ

source: Filter by company
am: ብድርጅት ለይ

source: Events list
am: የዝግጅቶች ዝርዝር

source: Upcoming Events
am: መጪ የዝግጅቶች

source: Open Events
am: ክፈት ዝግጅቶች

source: Suspended
am: ታግዷል

source: News list
am: የዜናዎች ዝርዝር

source: Chat with staff
am: ከሰራተኞች ጋር ይወያዩ

source: Poll title
am: የምርጫ ዝርዝር

source: Poll created at :
am: ምርጫው የተፈጠርበት ቀን

source: This poll has no choice, yet!
am: ይህ ምርጫ ምንም አማራጮች የሉትም

source: Highest votes
am: በመራጮች ድምጽ ብዛት

source: Proceed To Checkout
am: ወደ ቼክ - ኣውት ቀጥል

source: Inquiry Form
am: የጥያቄ ቅጽ

source: Inquiry Request Successfull!
am: ጥያቄዎ በተሳካ ሁኔታ ተስተናግዷል

source: search
am: ፈልግ

source: User
am: አዲስ ተጠቃሚ

source: Detail
am: ዝርዝር

source: Attachments
am: ፋይል

source: Research List
am: የምርምር ርዕስ

source: Add new Research
am: አዲስ ምርምር አስገባ

source: Filter by Category
am: በድርጅት አጣራ

source: Related Researches
am: አዲስ ምርምር አስገባ

source: Research you Posted
am: የርሶ ምርምሮች

source: Research Title
am: የምርምር ርዕስ

source: Research Status
am: የምርምር ሂደት

source: The Current Document
am: የአሁኑ ሰነድ

source: No attachments in the current time
am: ሰነድ የለም

source: Change your attachment (if you have one)
am: ሰነድ ይቀይሩ

source: Upload your attachment (if you have one)
am: ሰነድ ይላኩ

source: Add a Research
am: አዲስ ምርምር አስገባ

source: Research Category
am: ምርምር ምረጥ

source: Tenders list
am: ጨረታዎቸ

source: Tender
am: ጨረታ

source: Title
am: ርዕስ

source: Filter
am: አጣራ

source: Posted
am: በ

source: Vacancy list
am: ክፍት የሥራ ቦታ

source: category
am: ምድብ

source: Employment Type
am: የቅጥር አይነት

source: Cateory
am: ምድብ

source: Campany
am: ድርጅቶች

source: Starting date
am: የሚጀምርበት ቀን

source: Ending date
am: የሚያልቅበት ቀን

source: cateory
am: ምድብ

source: Employee Type
am: የቅጥር አይነት

source: Thanks for spending some quality time with the Web site today.
am: ለነበረን ጊዘ እናመሰናለን

source: Your password was changed.
am: የይለፍ ቃል ቀይር

source: Messages
am: ገጾች

source: Syndication
am: መልክት

source: Floating point number
am: ኩባንያ ቲን ቁጥር

source: Currently
am: ገንዘብ

source: March
am: ፈልግ

source: November
am: ስልክ ቁጥር

source: apr
am: አማርኛ

source: may
am: አማርኛ

source: oct
am: ፕሮጀክት

# abbrev. month
source: March
am: ፈልግ

# alt. month
source: March
am: ፈልግ

# alt. month
source: November
am: ስልክ ቁጥር

source: Checkout Page
am: ቼክ - ኣውት ገጽ

source: Shipping Information
am: የግብይት መረጃ

source: CONTINUE SHOPPING
am: ግብይት ቀጥል

source: Edit a Research
am: ምርምሮን ያስተካክሉ

source: Research Category Name
am: የምርምር ምድብ

source: Django Documentation
am: ፋይል አውርድ

source: Free Only
am: ነፃ ብቻ

source: Paid Only
am: የሚያስከፍሉ ብቻ

source: Open Only
am: ክፈት ብቻ

source: Log in again
am: እንደገና ግባ
